"""Banner utilities for the CLI."""

import sys

from rich import print as rprint

LOGO = r"""
[bold red]
██████╗ ██████╗ ██╗ ██████╗██╗  ██╗      ██████╗ ██████╗ ███████╗
██╔══██╗██╔══██╗██║██╔════╝██║ ██╔╝     ██╔═══██╗██╔══██╗██╔════╝
██████╔╝██████╔╝██║██║     █████╔╝█████╗██║   ██║██████╔╝███████╗
██╔══██╗██╔══██╗██║██║     ██╔═██╗╚════╝██║   ██║██╔═══╝ ╚════██║
██████╔╝██║  ██║██║╚██████╗██║  ██╗     ╚██████╔╝██║     ███████║
╚═════╝ ╚═╝  ╚═╝╚═╝ ╚═════╝╚═╝  ╚═╝      ╚═════╝ ╚═╝     ╚══════╝                                                                
[/]
[dim]🧱 BRICK-OPS • Databricks Ops Toolkit[/]
"""


def opt_print_banner() -> None:
    """
    Print the BRICKOPS banner if help is requested.
    Example: `dbops --help` or `dbops jobs --help`, etc.
    """
    if any(arg in ("--help", "-h") for arg in sys.argv):
        rprint(LOGO)
